#include <stdio.h>
#include <stdlib.h>
#include <conio.h>

#define up 72
#define down 80
#define left 75
#define right 77

#define goal1 map[7][17] //골인지점
#define goal2 map[7][16]
#define goal3 map[8][17]
#define goal4 map[8][16]

void drawmap();
void key();
int goal();
void stage();
void mapchange();

// 0=공백  
//1=■(벽)  
//2 = ◎골인지점
//3 = ◇옮겨야할상자
//4=★본인캐릭터 

char map[12][20] = { //메인 스테이지
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0},
	{0,1,0,0,0,1,0,0,1,0,0,1,0,0,1,0,0,0,0,0},
	{0,1,0,3,0,0,0,0,0,0,0,1,3,0,1,0,0,0,0,0},
	{0,1,1,1,1,1,1,0,0,0,0,1,0,0,1,0,0,0,0,0},
	{0,0,0,0,0,0,1,0,0,1,4,1,0,0,1,0,0,0,0,0},
	{0,1,1,1,1,1,1,1,0,1,1,1,0,0,1,1,1,1,1,0},
	{0,1,0,0,0,0,3,0,0,0,0,0,0,0,1,0,2,2,1,0},
	{0,1,0,0,3,0,1,0,0,0,0,0,0,0,0,0,2,2,1,0},
	{0,1,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0},
	{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};


char map2[12][20] = { // 스테이지2
	{0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
	{0,1,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0},
	{0,1,0,3,0,1,0,0,1,0,0,1,0,0,0,0,0,0,0,0},
	{1,1,0,3,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0},
	{1,0,0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0},
	{1,0,3,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0},
	{1,1,0,0,1,1,1,0,0,0,0,1,1,1,1,1,1,1,1,0},
	{0,1,1,1,1,0,3,0,0,0,0,0,0,0,0,0,2,2,1,0},
	{0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,2,2,1,0},
	{0,1,0,0,0,0,1,0,0,0,0,0,0,4,0,1,1,1,1,0},
	{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};

// 나의 위치 좌표
int x = 10;
int y = 5;
int* q = &x;
int* w = &y;


void main() //메인 게임
{
	while (1)
	{
		printf("스테이지 1\n");
 
		stage();

		if (goal())
		{
			drawmap();
			break;
		}
	}

	mapchange();
	
	*q = 13, *w = 9;
	while (1)
	{
		printf("스테이지 2\n");

		stage();

		if (goal())
		{
			drawmap();
			break;
		}
	}
	printf("게임 클리어 !!");
	
}

void mapchange()
{
	for (int i = 0; i < 12; i++)
	{
		for (int j = 0; j < 20; j++)
		{
			map[i][j] = map2[i][j];
		}
		printf("\n");
	}
	system("cls");
}


void stage()
{
	drawmap(); //맵 그리기

	key();  //키보드 입력 받기

	system("cls"); //맵 지우기 
}

void drawmap() //맵 지도
{
	for (int i = 0; i < 12; i++)
	{
		for (int j = 0; j < 20; j++)
		{
			switch (map[i][j])
			{
			case 0:
				printf("　");
				break;
			case 1:
				printf("▧");
				break;
			case 2:
				printf("◎");
				break;
			case 3:
				printf("◇");
				break;
			case 4:
				printf("Ω");
				break;
			}
		}
		printf("\n");
	}
}


void key() //키를 입력받는곳 
{
	int key;
	key = _getch();
	if (key == 224)key = _getch();

	switch (key)
	{
	case up:
		if (map[y - 1][x] == 0 || map[y - 1][x] == 2) //내 앞이 공백이거나 골인지점일경우 
		{
			map[y][x] = 0; //내가 있는값을 공백으로 바꿈
			y--; // 내 위치를 위로 변경
			map[y][x] = 4;  // 위치 변경한 곳에 나를 생성 
		}
		else if (map[y - 1][x] == 3) // 내 앞에 박스가 있다면 
		{
			if (map[y - 2][x] == 1 || map[y - 2][x] == 3) //상자앞에 벽 또는 상자가 있다면 (내 기준 두칸앞)
				return; // 다시 메인 함수로 ㄱㄱ 즉 다시 입력받음
			map[y][x] = 0; //내가 있는 위치를 공백으로 바꿈
			y--; // 내 위치를 위로 변경 (상자가 있는 자리에 온것)
			map[y][x] = 4; // 변경한 자리에 나를 생성 (상자의 값을 나로 바꿈 여기까진 상자가 없어진것 )
			map[y - 1][x] = 3; //그 앞에다가 박스의 값 생성 ( 위에서 한칸 옮겼기 때문에 총 y-2칸에 상자를 찍은것 ) 
		}
		break;
		//즉 박스를 만났을경우 박스의 위치에 나를 찍고 내앞에 박스를 만들었기때문에
		// 프로그램상으로는 나와 박스가 동시에 움직였다고 생각됨 아래는 동일

	case down:
		if (map[y + 1][x] == 0 || map[y + 1][x] == 2)
		{
			map[y][x] = 0;
			y++;
			map[y][x] = 4;
		}
		else if (map[y + 1][x] == 3)
		{
			if (map[y + 2][x] == 1 || map[y + 2][x] == 3)
				return;
			map[y][x] = 0;
			y++;
			map[y][x] = 4;
			map[y + 1][x] = 3;
		}
		break;

	case left:
		if (map[y][x - 1] == 0 || map[y][x - 1] == 2)
		{
			map[y][x] = 0;
			x--;
			map[y][x] = 4;
		}
		else if (map[y][x - 1] == 3)
		{
			if (map[y][x - 2] == 1 || map[y][x - 2] == 3)
				return;
			map[y][x] = 0;
			x--;
			map[y][x] = 4;
			map[y][x - 1] = 3;
		}
		break;

	case right:
		if (map[y][x + 1] == 0 || map[y][x + 1] == 2)
		{
			map[y][x] = 0;
			x++;
			map[y][x] = 4;
		}
		else if (map[y][x + 1] == 3)
		{
			if (map[y][x + 2] == 1 || map[y][x + 2] == 3)
				return;
			map[y][x] = 0;
			x++;
			map[y][x] = 4;
			map[y][x + 1] = 3;
		}
		break;
	}
}


int goal() //골 지점확인 
{
	if (goal1 == 0)
		goal1 = 2;
	if (goal2 == 0)
		goal2 = 2;
	if (goal3 == 0)
		goal3 = 2;
	if (goal4 == 0)
		goal4 = 2;

	if (goal1 == 3 && goal2 == 3 && goal3 == 3 && goal4 == 3)
		return 1;

	return 0;
}