#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <conio.h>
#include <windows.h>


#define up 72
#define down 80
#define left 75
#define right 77
#define space 32


void keyboard();
void drawmap();
void GameStart();
void block();
void block2();

int x=4, y=1;
int u=0;

char map[22][12]={  //테트리스의 기본맵
	{5,5,5,5,5,5,5,5,5,5,5,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,0,0,0,0,0,0,0,0,0,0,5},
	{5,5,5,5,5,5,5,5,5,5,5,5},
};

//1모양 2회전 3,4 형태
char blocks[3][4][5][5]={
	//ㄴ자 모양
	0,0,0,0,0,
	0,1,0,0,0,
	0,1,1,1,0,
	0,0,0,0,0,
	0,0,0,0,0,

	0,0,0,0,0,
	0,1,1,0,0,
	0,1,0,0,0,
	0,1,0,0,0,
	0,0,0,0,0,

	0,0,0,0,0,
	0,1,1,1,0,
	0,0,0,1,0,
	0,0,0,0,0,
	0,0,0,0,0,

	0,0,0,0,0,
	0,0,1,0,0,
	0,0,1,0,0,
	0,1,1,0,0,
	0,0,0,0,0,
	//ㄴ반대모양
	0,0,0,0,
	0,0,0,1,
	0,1,1,1,
	0,0,0,0,

	0,0,0,0,
	0,1,1,0,
	0,0,1,0,
	0,0,1,0,

	0,0,0,0,
	1,1,1,0,
	1,0,0,0,
	0,0,0,0,

	0,1,0,0,
	0,1,0,0,
	0,1,1,0,
	0,0,0,0,

	//ㅗ되다만모양
	0,0,0,0,
	0,0,1,0,
	0,1,1,1,
	0,0,0,0,

	0,0,0,0,
	0,0,1,0,
	0,1,1,0,
	0,0,1,0,

	0,0,0,0,
	0,0,0,0,
	0,1,1,1,
	0,0,1,0,

	0,0,0,0,
	0,0,1,0,
	0,0,1,1,
	0,0,1,0,
};


void main()
{/*
	system("mode con cols=30 lines=25");
	GameStart();
	*/
	while (1)
	{
	drawmap();
	block();
	block2();

	keyboard();

	system("cls");
	}
}


void block2()
{
	Sleep(300);
	y++;
}


void block() //블록을 맵에 복사
{
	for (int i = 0; i < 5; i++)
	{
		for (int j = 0; j < 5; j++)
		{
			map[i + y][j + x] = blocks[0][u][i][j];
		}
	}
}

/* 시작구문
void GameStart()
{
	char win[12] = { "tetris game" };
	printf("\n\n\n\n\n\n\n\n    ");
	for (int i = 0; i < 12; i++)
	{
		Sleep(300);
		printf("%c ", win[i]);
	}
	Sleep(500);
	system("cls");
}*/



void drawmap()
{
	for (int i = 0; i < 22; i++)
	{
		for (int j = 0; j < 12; j++)
		{
			switch (map[i][j])
			{
			case 0:
				printf("·");
				break;
			case 1:
				printf("■");
				break;
			case 5:
				printf("▨");
				break;
			}
		}
		printf("\n");
	}
}


void keyboard() //키보드 입력
{
	int key;
	int move=0;

	while (_kbhit())
	{
		key = _getch();
		if (key == 224)key = _getch(); //입력구문

		switch (key)
		{
		case up:
			u++;
			if (u > 4)u = 0;
			break;

		case down:
			break;

		case left:
			x--;
			break;

		case right:
			x++;
			break;
		}
		if (space == 32)
		{

		}
	}

}